takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
static void meas_data_output_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    
    uint32_t err_code;
    //static char com_buf[128] = "";
    //uint16_t j;
    //unsigned int ind;

    static char restime[20] =   "";
    static char resdatanum[4] = "";
    static char respulse[4] =   "";
    static char restemp[36] =   "";
    static char resdata[128] =  "";
    uint16_t reslength;

    //NRF_LOG_INFO("it will measurement data output");

    //for (j = 0; j < Count_index_data_hr_hr; j++)
    //{
    //ind = Read_index_data_hr_hr;
    //ind = Read_index_data_hr_hr + 1;
    //if (ind > Num_of_data_hr_hr - 1)
    //{
    //    ind = ind - Num_of_data_hr_hr;
    //}

    //data_hr_hr[Write_index_data_hr_hr].body_temperature_array[Meas10sec - 1] = Body_temperature;
    //data_hr_hr[Write_index_data_hr_hr].heart_rate = BPM;
    sprintf(restime, "%04d-%02d-%02dT%02d:%02d:%02d", 
    data_hr_hr[Read_index_data_hr_hr].start_time.year, 
    data_hr_hr[Read_index_data_hr_hr].start_time.month, 
    data_hr_hr[Read_index_data_hr_hr].start_time.day, 
    data_hr_hr[Read_index_data_hr_hr].start_time.hours, 
    data_hr_hr[Read_index_data_hr_hr].start_time.minutes, 
    data_hr_hr[Read_index_data_hr_hr].start_time.seconds);
    //sprintf(resdatanum, "%03d", Count_index_data_hr_hr - j);
    sprintf(resdatanum, "%03d", Count_index_data_hr_hr);
    sprintf(respulse,"%03d", data_hr_hr[Read_index_data_hr_hr].heart_rate);
    NRF_LOG_INFO("%03d", data_hr_hr[Read_index_data_hr_hr].heart_rate);
    //sprintf(respulse,"%03d", 0);

    //sprintf(restemp, "%05.2f,%05.2f,%05.2f,%05.2f,%05.2f,%05.2f", 
    //    data_hr_hr[ind].body_temperature_array[0],
    //    data_hr_hr[ind].body_temperature_array[1],
    //    data_hr_hr[ind].body_temperature_array[2],
    //    data_hr_hr[ind].body_temperature_array[3],
    //    data_hr_hr[ind].body_temperature_array[4],
    //    data_hr_hr[ind].body_temperature_array[5]);

    //NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
    sprintf(restemp, 
        "" NRF_LOG_FLOAT_MARKER "," NRF_LOG_FLOAT_MARKER "," NRF_LOG_FLOAT_MARKER "," NRF_LOG_FLOAT_MARKER "," NRF_LOG_FLOAT_MARKER "," NRF_LOG_FLOAT_MARKER "", 
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[0]),
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[1]),
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[2]),
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[3]),
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[4]),
        NRF_LOG_FLOAT(data_hr_hr[Read_index_data_hr_hr].body_temperature_array[5]));
    strcpy(resdata, restime);
    strcat(resdata, ",");
    strcat(resdata, resdatanum);
    strcat(resdata, ",");
    strcat(resdata, respulse);
    strcat(resdata, ",");
    strcat(resdata, restemp);
    reslength = strlen(resdata);
    //reslength = strlen(restime) + 1 + strlen(resdatanum) + 1 + strlen(respulse) + 1 + strlen(restemp);
    //NRF_LOG_INFO("res: %s", resdata);
    err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
    //}

    Read_index_data_hr_hr++;
    //Read_index_data_hr_hr = Read_index_data_hr_hr + Count_index_data_hr_hr;
    if (Read_index_data_hr_hr > Num_of_data_hr_hr - 1)
    {
        //Read_index_data_hr_hr = Read_index_data_hr_hr - Num_of_data_hr_hr;
        Read_index_data_hr_hr = 0;
    }

    //Count_index_data_hr_hr = 0;
    Count_index_data_hr_hr--;
    NRF_LOG_INFO("data decrement:%03d, %03d", Count_index_data_hr_hr, Read_index_data_hr_hr - 1);

    if (Count_index_data_hr_hr < 1)
    {
        Count_index_data_hr_hr = 0;
        err_code = app_timer_stop(m_data_output_timer_id);
        APP_ERROR_CHECK(err_code);
    }
    NRF_LOG_INFO("Write: %d", Write_index_data_hr_hr);
    NRF_LOG_INFO("Read: %d", Read_index_data_hr_hr);
    NRF_LOG_INFO("Count: %d", Count_index_data_hr_hr);
    NRF_LOG_FLUSH();
}






/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
/*
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        case BSP_EVENT_KEY_0:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                temperature_measurement_send();
            }
            break;

        default:
            break;
    }
}
*/
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;
/*
    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
*/
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}



/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}






/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            if (State_keeper == STATE_MEASURINGADVERTISING)
            {
                State_keeper = STATE_MEASURING;
            }
            else
            {
                // not state_measuring
                State_keeper = STATE_PAIRING;
            }
            NRF_LOG_INFO("State_keeper: %d", State_keeper);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected, reason %d.",
                          p_ble_evt->evt.gap_evt.params.disconnected.reason);
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            m_hts_meas_ind_conf_pending = false;
            if (State_keeper == STATE_MEASURING)
            {
                State_keeper = STATE_MEASURINGADVERTISING;
            }
            else
            {
                // not state_measuring
                State_keeper = STATE_ADVERTISING;
            }
            NRF_LOG_INFO("State_keeper: %d", State_keeper);
            break;

