takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
                        if ((temp_year >= 1900 && temp_year < 2200) &&
                            (temp_month >= 1 && temp_month < 12) &&
                            (temp_day >= 1 && temp_day <= max_temp_days))
                        {
                          time_stamp.year = temp_year;
                          time_stamp.month = temp_month;
                          time_stamp.day = temp_day;
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 5:   // 5: sct
                        /* Ex. "sct 23:59:55" */
                        temp_hours =   strtol((const char *)(&com_buf[4]), NULL, 10);
                        temp_minutes = strtol((const char *)(&com_buf[7]), NULL, 10);
                        temp_seconds = strtol((const char *)(&com_buf[10]), NULL, 10);

                        if ((temp_hours >= 0 && temp_hours < 24) &&
                            (temp_minutes >= 0 && temp_minutes < 60) &&
                            (temp_seconds >= 0 && temp_seconds < 60))
                        {
                          time_stamp.hours = temp_hours;
                          time_stamp.minutes = temp_minutes;
                          time_stamp.seconds = temp_seconds;
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 30:   // 30: dhr
                        Debug_output_heart_rate = true;
                        Debug_output_body_temperature = false;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 31:   // 31: dbt
                        Debug_output_heart_rate = false;
                        Debug_output_body_temperature = true;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 32:   // 32: dsp
                        Debug_output_heart_rate = false;
                        Debug_output_body_temperature = false;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 33:   // 33: dct
                        //char restime[] =    "2018-12-25T12:20:15";
                        NRF_LOG_INFO("%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
                        sprintf(restime, "%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
                        reslength = strlen(restime);
                        err_code = ble_nus_data_send(&m_nus, &restime[0], &reslength, m_conn_handle);
                        break;
                    case 34:   // 34: ver
                        NRF_LOG_INFO("FIRMWARE_VERSION: %s", FIRMWARE_VERSION);
                        sprintf(resdata, "FIRMWARE_VERSION: %s", FIRMWARE_VERSION);
                        reslength = strlen(resdata);
                        err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                        break;
                    default:
                        break;
                }
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
                break;
            }
        }
        if (i == Number_of_command)
        {
            //NRF_LOG_INFO("nak");
            NRF_LOG_INFO("Number_of_command: %d", Number_of_command);
            reslength = 3;
            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
            if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND))
            {
                APP_ERROR_CHECK(err_code);
            }
        }
    }

}

/**@snippet [Handling the data received over BLE] */

/**@brief Function for simulating and sending one Temperature Measurement.
 */
static void temperature_measurement_send(void)
{
    ble_hts_meas_t simulated_meas;
    ret_code_t     err_code;

    if (!m_hts_meas_ind_conf_pending)
    {
        hts_measurement(&simulated_meas);

        err_code = ble_hts_measurement_send(&m_hts, &simulated_meas);

        switch (err_code)
        {
            case NRF_SUCCESS:
                // Measurement was successfully sent, wait for confirmation.
                m_hts_meas_ind_conf_pending = true;
                break;

            case NRF_ERROR_INVALID_STATE:
                // Ignore error.
                break;

            default:
                APP_ERROR_HANDLER(err_code);
                break;
        }
    }
}


/**@brief Function for handling the Health Thermometer Service events.
 *
 * @details This function will be called for all Health Thermometer Service events which are passed
 *          to the application.
 *
 * @param[in] p_hts  Health Thermometer Service structure.
 * @param[in] p_evt  Event received from the Health Thermometer Service.
 */
static void on_hts_evt(ble_hts_t * p_hts, ble_hts_evt_t * p_evt)
{
    temperature_measurement_send();
    /*
    switch (p_evt->evt_type)
    {
        case BLE_HTS_EVT_INDICATION_ENABLED:
            // Indication has been enabled, send a single temperature measurement
            temperature_measurement_send();
            break;

        case BLE_HTS_EVT_INDICATION_CONFIRMED:
            m_hts_meas_ind_conf_pending = false;
            break;

        default:
            // No implementation needed.
            break;
    }
    */
}






/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code;

    //err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    //APP_ERROR_CHECK(err_code);

