takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    //return rc;   //rc is return value that arduino, Wire endTransmission, rc:0 is normal
    return 0;
}

// Note:  I2C access should be completed within 0.5ms
int32_t i2c_read(uint8_t slv_adr, uint8_t reg_adr, uint8_t *reg, uint8_t reg_size)
{
    ret_code_t err_code;

    /*
    // m_bh1792.prm.msr      = BH1792_PRM_MSR_SINGLE, none
    if (m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      while(FlexiTimer2::count == 1999);
    }
    */

    uint32_t timeout = BH1792_TWI_TIMEOUT;

    err_code = nrf_drv_twi_tx(&m_twi, slv_adr, &reg_adr, 1, false);
    if(err_code != NRF_SUCCESS) return err_code;

    while((!twi_tx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_tx_done = false;

    err_code = nrf_drv_twi_rx(&m_twi, slv_adr, reg, reg_size);
    if(err_code != NRF_SUCCESS) return err_code;

    timeout = BH1792_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_rx_done = false;

    //return rc;  //rc:0 is normal, rc:4 is error. but in nrf5 when case of error, already return
    return 0;
}

/*
void error_check(int32_t ret, String msg)
{
  if(ret < 0) {
    msg = "Error: " + msg;
    msg += " function";
    NRF_LOG_INFO("%s\n", msg);
    NRF_LOG_INFO("ret = ");
    NRF_LOG_INFO("%d", ret);
    if(ret == BH1792_I2C_ERR) {
      NRF_LOG_INFO("i2c_ret = ");
      NRF_LOG_INFO("%d\n", m_bh1792.i2c_err);
    }
    while(1);
  }
}
*/






/** @brief: Function for handling the RTC0 interrupts.
 * Triggered on TICK and COMPARE0 match.
 */
static volatile int Tick_count = 0;
static volatile int Enter_sleep_count = 0;
static volatile int Boot_count = 0;
static volatile int Wait_sleep_count = 0;

void wait_for_flash_ready(nrf_fstorage_t const * p_fstorage);

const uint8_t write_count = 4;
const uint32_t Flash_start_address = 0x60000;
static volatile uint32_t write_index = Flash_start_address;
static uint8_t flash_ff_padding[4096] = {0xFF};

static volatile int size_write_data = sizeof(data_hr_hr[0]);
const int size_write_buffer = sizeof(data_hr_hr[0]) * 8;
static uint8_t write_buffer[sizeof(data_hr_hr[0]) * 8];
const int Flash_write_count_for_sleep = Num_of_data_hr_hr / 8;

static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
    ret_code_t rc;
    if (int_type == NRF_DRV_RTC_INT_TICK)
    {
        if (Tick_count == 4 || Tick_count == 8)
        {
            m_xfer_done = true;
        }


        /*Blink/light up LED display state, State_keeper.
        // Blink GREEN: Advertising that Before Pairing, 0
        // GREEN: Pairing and Idle state, 1
        // RED: Measring state and Pairing, 2
        // Blink GREEN and RED: Emergency, 3
        // Blink RED: Measuring and Adverting, 4
        // BLUE: boot, reboot from sleep, 5
        // Blink BLUE: go to sleep, 6
        */
        if (LED_output_state)
        {
            if (Boot_count < 24)
            {
                // BLUE: boot, reboot from sleep, 5
                nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                nrf_drv_gpiote_out_clear(LED_3_COLOR_BLUE_PIN);

                if(Boot_count == 4)
                {
                    memset(&flash_ff_padding[0], 0xFF, sizeof(flash_ff_padding));
                    NRF_LOG_INFO("ff[0000]: 0x%x", flash_ff_padding[0]);
                    NRF_LOG_INFO("ff[2016]: 0x%x ", flash_ff_padding[2016]);
                    NRF_LOG_INFO("ff[4095]: 0x%x ", flash_ff_padding[4095]);
                }
                else if (Boot_count == 5)
                {
                    rc = nrf_fstorage_write(&fstorage, write_index, &flash_ff_padding[0], sizeof(flash_ff_padding), NULL);
                    APP_ERROR_CHECK(rc);
                }
                else if (Boot_count == 6)
                {
                    rc = nrf_fstorage_write(&fstorage, write_index + 0x1000, &flash_ff_padding[0], sizeof(flash_ff_padding), NULL);
                    APP_ERROR_CHECK(rc);
                }
                else if (Boot_count == 7)
                {
                    rc = nrf_fstorage_write(&fstorage, write_index + 0x2000, &flash_ff_padding[0], sizeof(flash_ff_padding), NULL);
                    APP_ERROR_CHECK(rc);
                }
                //Boot_count++;
            }
            else if (State_emergency_lock == true)
            {
                // State_keeper == STATE_EMERGENCY
                // Blink GREEN and RED: Emergency, 3
                if (Tick_count % 2 == 0)
                {
                    nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                }
                else
                {
                    nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                }
            }
            else
            {
                switch (State_keeper)
                {
                    case 0: //STATE_ADVERTISING:
                        // Blink GREEN: Advertising that Before Pairing, 0
                        if (Tick_count == 0)
                        {
                            nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                            }
                        else
                        {
                            nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);               
                        }
                        break;
                    case 1: //STATE_PAIRING:
                        // GREEN: Pairing and Idle state, 1
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        break;
                    case 2: //STATE_MEASURING (and STATE_PAIRING):
                        // RED: Measring state and Pairing, 2
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        break;
                    case 3: //STATE_EMERGENCY:
                        // Blink GREEN and RED: Emergency, 3
                        if (Tick_count % 2 == 0)
                        {
                            nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        }
                        else
                        {
                            nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        }
                        break;
                    case 4: //STATE_
                        // Blink RED: Measuring and Adverting, 4
                        if (Tick_count == 0)
                        {
                            nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                            }
                        else
                        {
                            nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                            nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);               
                        }
                        break;
                    case 5:
                        // BLUE: boot, reboot from sleep, 5
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_BLUE_PIN);
                        break;
                    case 6:
                        // Blink BLUE: go to sleep, 6
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_toggle(LED_3_COLOR_BLUE_PIN);
                        break;
                    default:
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                }
            }
        }
        else
        {
            if (State_keeper == STATE_SLEEPING)
            {
                // Blink BLUE: go to sleep, 6
                nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                nrf_drv_gpiote_out_toggle(LED_3_COLOR_BLUE_PIN);
            }
            else
            {
                nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
            }
        }

        if (nrf_gpio_pin_read(SWITCH1_PIN))
        {
            //NRF_LOG_INFO("swith1 true");
            Enter_sleep_count = 0;
        }
        else
        {
            //NRF_LOG_INFO("switch1 false");
            Enter_sleep_count++;
            if (Enter_sleep_count == 24)
            {
                //3s long push and sleep mode enter
                NRF_LOG_INFO("sleep mode enter");

                rc = app_timer_stop(m_data_record_timer_id);
                APP_ERROR_CHECK(rc);
                NRF_LOG_INFO("10 second measure and 10 minutes record stop");
                if (State_keeper == STATE_MEASURING)
                {
                    State_keeper = STATE_PAIRING;
                    NRF_LOG_INFO("State_keeper: %d", State_keeper);
                }

                NRF_LOG_FLUSH();
                sleep_mode_enter();
            }
        }

        if (State_keeper == STATE_SLEEPING)
        {
            if (Wait_sleep_count < Flash_write_count_for_sleep)
            {
                /*
                // for debug begin
                if (Wait_sleep_count > 0)
                {
                    int check_index = Wait_sleep_count - 1;
                    uint8_t check_read_data[sizeof(data_hr_hr[check_index])];
                    int check_read_address = write_index - sizeof(data_hr_hr[check_index]);
                    rc = nrf_fstorage_read(&fstorage, check_read_address, check_read_data, sizeof(check_read_data));
                    if (rc != NRF_SUCCESS)
                    {
                        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
                    }
                    ble_data_ht_hr_t check_data_hr_hr = *(ble_data_ht_hr_t *)(check_read_data);
                    if (check_data_hr_hr.start_time.year != data_hr_hr[check_index].start_time.year) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.start_time.month != data_hr_hr[check_index].start_time.month) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.start_time.day != data_hr_hr[check_index].start_time.day) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.start_time.hours != data_hr_hr[check_index].start_time.hours) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.start_time.minutes != data_hr_hr[check_index].start_time.minutes) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.start_time.seconds != data_hr_hr[check_index].start_time.seconds) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.heart_rate != data_hr_hr[check_index].heart_rate) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[0] != data_hr_hr[check_index].body_temperature_array[0]) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[1] != data_hr_hr[check_index].body_temperature_array[1]) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[2] != data_hr_hr[check_index].body_temperature_array[2]) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[3] != data_hr_hr[check_index].body_temperature_array[3]) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[4] != data_hr_hr[check_index].body_temperature_array[4]) { NRF_LOG_INFO("Error write failed"); }
                    if (check_data_hr_hr.body_temperature_array[5] != data_hr_hr[check_index].body_temperature_array[5]) { NRF_LOG_INFO("Error write failed"); }
                    NRF_LOG_INFO("Check read done, 0x%x", check_read_address);
                    NRF_LOG_FLUSH();
                }
                // for debug end
                */

