takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
                memcpy(&write_buffer[size_write_data * 0], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 0]), size_write_data);
                memcpy(&write_buffer[size_write_data * 1], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 1]), size_write_data);
                memcpy(&write_buffer[size_write_data * 2], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 2]), size_write_data);
                memcpy(&write_buffer[size_write_data * 3], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 3]), size_write_data);
                memcpy(&write_buffer[size_write_data * 4], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 4]), size_write_data);
                memcpy(&write_buffer[size_write_data * 5], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 5]), size_write_data);
                memcpy(&write_buffer[size_write_data * 6], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 6]), size_write_data);
                memcpy(&write_buffer[size_write_data * 7], (const void *)(&data_hr_hr[Wait_sleep_count * 8 + 7]), size_write_data);
                rc = nrf_fstorage_write(&fstorage, write_index, &write_buffer, sizeof(write_buffer), NULL);
                APP_ERROR_CHECK(rc);
                write_index = write_index + sizeof(write_buffer);

                NRF_LOG_INFO("Done, %d", Wait_sleep_count);
                NRF_LOG_FLUSH();
            }
            else if (Wait_sleep_count == Flash_write_count_for_sleep)
            {
                //Current time, time_stamp
                uint8_t write_time_stamp[sizeof(time_stamp)];
                *(ble_date_time_t *) write_time_stamp = time_stamp;
                rc = nrf_fstorage_write(&fstorage, write_index, &write_time_stamp, sizeof(write_time_stamp), NULL);
                APP_ERROR_CHECK(rc);
                write_index = write_index + sizeof(write_time_stamp);

                NRF_LOG_INFO("Done, %d", Wait_sleep_count);
                NRF_LOG_FLUSH();
            }
            else if (Wait_sleep_count == Flash_write_count_for_sleep + 1)
            {
                //Write index, Write_index_data_hr_hr
                uint8_t write_write_index[sizeof(Write_index_data_hr_hr)];
                *(unsigned int *) write_write_index = Write_index_data_hr_hr;
                rc = nrf_fstorage_write(&fstorage, write_index, &write_write_index, sizeof(write_write_index), NULL);
                APP_ERROR_CHECK(rc);
                write_index = write_index + sizeof(write_write_index);

                NRF_LOG_INFO("Done, %d", Wait_sleep_count);
                NRF_LOG_FLUSH();
            }
            else if (Wait_sleep_count == Flash_write_count_for_sleep + 2)
            {
                //Read index, Read_index_data_hr_hr
                uint8_t write_read_index[sizeof(Read_index_data_hr_hr)];
                *(unsigned int *) write_read_index = Read_index_data_hr_hr;
                rc = nrf_fstorage_write(&fstorage, write_index, &write_read_index, sizeof(write_read_index), NULL);
                APP_ERROR_CHECK(rc);
                write_index = write_index + sizeof(write_read_index);

                NRF_LOG_INFO("Done, %d", Wait_sleep_count);
                NRF_LOG_FLUSH();
            }
            else if (Wait_sleep_count == Flash_write_count_for_sleep + 3)
            {
                //Count index, Count_index_data_hr_hr
                uint8_t write_count_index[sizeof(Count_index_data_hr_hr)];
                *(unsigned int *) write_count_index = Count_index_data_hr_hr;
                rc = nrf_fstorage_write(&fstorage, write_index, &write_count_index, sizeof(write_count_index), NULL);
                APP_ERROR_CHECK(rc);
                write_index = write_index + sizeof(write_count_index);

                NRF_LOG_INFO("Done, %d", Wait_sleep_count);
                NRF_LOG_FLUSH();
            }
            else if (Wait_sleep_count > Flash_write_count_for_sleep + 3)
            {
                // Go to system-off mode (this function will not return; wakeup will cause a reset).
                NRF_LOG_INFO("system-off and sleep");
                NRF_LOG_FLUSH();
                sd_power_system_off();
                //rc = sd_power_system_off();
                //APP_ERROR_CHECK(rc);
            }

            Wait_sleep_count++;
        }

        if (Boot_count < 24)
        {
            Boot_count++;
        }

        Tick_count++;
        if (Tick_count > 9)
        {
            Tick_count = 0;
        }
    }
}

const nrf_drv_rtc_t rtc = NRF_DRV_RTC_INSTANCE(2); /**< Declaring an instance of nrf_drv_rtc for RTC2. */
/** @brief Function initialization and configuration of RTC driver instance.
 */
static void rtc_config(void)
{
    uint32_t err_code;

    //Initialize RTC instance
    nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
    config.prescaler = 4095;
    err_code = nrf_drv_rtc_init(&rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    //Enable tick event & interrupt
    nrf_drv_rtc_tick_enable(&rtc, true);

    //Power on RTC instance
    nrf_drv_rtc_enable(&rtc);
}



/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_heart_rate_timer_id, HEART_RATE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_rr_interval_timer_id, RR_INTERVAL_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_temperature_timer_id, TEMPERATURE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_sensor_contact_timer_id, SENSOR_CONTACT_DETECTED_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    //err_code = app_timer_start(m_bh1792glc_timer_id, BH1792GLC_MEAS_INTERVAL, NULL);
    //APP_ERROR_CHECK(err_code);

    //err_code = app_timer_start(m_data_record_timer_id, DATA_RECORD_MEAS_INTERVAL, NULL);
    //APP_ERROR_CHECK(err_code);
}



/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

