takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        uint32_t err_code;
        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}



/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    //UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    //nrf_pwr_mgmt_run();
    /*
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
    */
    do
    {
        //__WFE();
        nrf_pwr_mgmt_run();
    }while (m_xfer_done == false);
    NRF_LOG_FLUSH();
    m_xfer_done = false;
}



static void print_flash_info(nrf_fstorage_t * p_fstorage)
{
    NRF_LOG_INFO("========| flash info |========");
    NRF_LOG_INFO("erase unit: \t%d bytes",      p_fstorage->p_flash_info->erase_unit);
    NRF_LOG_INFO("program unit: \t%d bytes",    p_fstorage->p_flash_info->program_unit);
    NRF_LOG_INFO("==============================");
}

void wait_for_flash_ready(nrf_fstorage_t const * p_fstorage)
{
    /* While fstorage is busy, sleep and wait for an event. */
    while (nrf_fstorage_is_busy(p_fstorage))
    {
        //power_manage();
        //sd_app_evt_wait();
        nrf_pwr_mgmt_run();
    }
}






/**@brief Application main function.
 */
int main(void)
  {
    bool erase_bonds;

    // Initialize.
    State_keeper = STATE_BOOTING;
    Boot_count = 0;
    log_init();
    uart_init();
    NRF_LOG_INFO("Finish uart init, log init");
    lfclk_request();
    gpio_init();
    NRF_LOG_INFO("Finish gpio init");;
    timers_init();
    NRF_LOG_INFO("Finish timers init");    
    buttons_leds_init(&erase_bonds);
    NRF_LOG_INFO("Finish buttons leds init");
    power_management_init();
    NRF_LOG_INFO("Finish power management init");
    ble_stack_init();
    NRF_LOG_INFO("Finish ble stack init");
    gap_params_init();
    NRF_LOG_INFO("Finish gap params init");
    gatt_init();
    NRF_LOG_INFO("Finish gatt init");
    services_init();
    NRF_LOG_INFO("Finish services init");
    advertising_init();
    NRF_LOG_INFO("Finish advertising init");
    sensor_simulator_init();
    NRF_LOG_INFO("Finish sensor simulator init");
    conn_params_init();
    NRF_LOG_INFO("Finish conn params init");
    peer_manager_init();
    NRF_LOG_INFO("Finish saadc_init init");
    saadc_sampling_event_init();
    NRF_LOG_INFO("Finish peer manager init");
    saadc_init();
    NRF_LOG_INFO("Finish saadc_sampling_event_init init");
    saadc_sampling_event_enable();
    NRF_LOG_INFO("SAADC HAL simple example started.");
    //NRF_LOG_INFO("TWI sensor example started.");
    NRF_LOG_FLUSH();
    //twi_init();
    //NRF_LOG_INFO("finished twi init.");
    rtc_config();
    NRF_LOG_INFO("finished rtc config.")

    ret_code_t rc;
    NRF_LOG_INFO("fstorage example started.");
    nrf_fstorage_api_t * p_fs_api;
    NRF_LOG_INFO("SoftDevice is present.");
    NRF_LOG_INFO("Initializing nrf_fstorage_sd implementation...");
    /* Initialize an fstorage instance using the nrf_fstorage_sd backend.
     * nrf_fstorage_sd uses the SoftDevice to write to flash. This implementation can safely be
     * used whenever there is a SoftDevice, regardless of its status (enabled/disabled). */
    p_fs_api = &nrf_fstorage_sd;
    rc = nrf_fstorage_init(&fstorage, p_fs_api, NULL);
    APP_ERROR_CHECK(rc);
    print_flash_info(&fstorage);
    /* It is possible to set the start and end addresses of an fstorage instance at runtime.
     * They can be set multiple times, should it be needed. The helper function below can
     * be used to determine the last address on the last page of flash memory available to
     * store data. */
    (void) nrf5_flash_end_addr_get();

    /* Let's write to flash. */
    /*
    uint32_t test_write_address = 0x60000;
    NRF_LOG_INFO("Writing \"%x\" to flash.", m_data);
    rc = nrf_fstorage_write(&fstorage, test_write_address, &m_data, sizeof(m_data), NULL);
    APP_ERROR_CHECK(rc);

    wait_for_flash_ready(&fstorage);
    NRF_LOG_INFO("Done.");

    uint8_t    data[256] = {0};

    rc = nrf_fstorage_read(&fstorage, test_write_address, data, 8);
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }

    for (uint32_t i = 0; i < 8; i++)
    {
        NRF_LOG_INFO("0x%x ", data[i]);
    }
    */

    uint32_t i = 0;
    uint32_t read_address = Flash_start_address;
    static uint8_t read_data[sizeof(data_hr_hr[0])];

    for (i = 0; i <  Num_of_data_hr_hr; i++)
    {
        rc = nrf_fstorage_read(&fstorage, read_address, read_data, sizeof(read_data));
        if (rc != NRF_SUCCESS)
        {
            NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
        }
        data_hr_hr[i] = *(ble_data_ht_hr_t *)(read_data);
        NRF_LOG_INFO("Read done, %d, 0x%x", i, read_address);
        NRF_LOG_FLUSH();
        read_address = read_address + sizeof(read_data);
    }

    //Current time, time_stamp
    static uint8_t read_time_stamp[sizeof(time_stamp)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_time_stamp, sizeof(read_time_stamp));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    //time_stamp = *(ble_date_time_t *)(read_time_stamp);
    volatile ble_date_time_t temp_stamp = *(ble_date_time_t *)(read_time_stamp);
    if (temp_stamp.year > 1900 && temp_stamp.year < 2200)
    {
        time_stamp.year = temp_stamp.year;
    }
    else
    {
        NRF_LOG_INFO("Read error: year, %d", temp_stamp.year);
    }
    if (temp_stamp.month > 0 && temp_stamp.month < 13)
    {
        time_stamp.month = temp_stamp.month;
    }
    else
    {
        NRF_LOG_INFO("Read error: month, %d", temp_stamp.month);
    }
    if (temp_stamp.day > 0 && temp_stamp.day < 32)
    {
        time_stamp.day = temp_stamp.day;
    }
    else
    {
        NRF_LOG_INFO("Read error: day, %d", temp_stamp.day);
    }
    if (temp_stamp.hours < 24)
    {
        time_stamp.hours = temp_stamp.hours;
    }
    else
    {
        NRF_LOG_INFO("Read error: hours, %d", temp_stamp.hours);
    }
    if (temp_stamp.minutes < 60)
    {
        time_stamp.minutes = temp_stamp.minutes;
    }
    else
    {
        NRF_LOG_INFO("Read error: minutes, %d", temp_stamp.minutes);
    }
    if (temp_stamp.seconds < 60)
    {
        time_stamp.seconds = temp_stamp.seconds;
    }
    else
    {
        NRF_LOG_INFO("Read error: seconds, %d", temp_stamp.seconds);
    }
    NRF_LOG_INFO("%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_time_stamp);

