takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    //Write index, Write_index_data_hr_hr
    static uint8_t read_write_index[sizeof(Write_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_write_index, sizeof(read_write_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Write_index_data_hr_hr = *(unsigned int *)(read_write_index);
    if (temp_Write_index_data_hr_hr < Num_of_data_hr_hr)
    {
        Write_index_data_hr_hr = temp_Write_index_data_hr_hr;
    }
    else
    {
        Write_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_write_index);

    //Read index, Read_index_data_hr_hr
    static uint8_t read_read_index[sizeof(Read_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_read_index, sizeof(read_read_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Read_index_data_hr_hr = *(unsigned int *)(read_read_index);
    if (temp_Read_index_data_hr_hr < Num_of_data_hr_hr)
    {
        Read_index_data_hr_hr = temp_Read_index_data_hr_hr;
    }
    else
    {
        Read_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_read_index);

    //Count index, Count_index_data_hr_hr
    static uint8_t read_count_index[sizeof(Count_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_count_index, sizeof(read_count_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Count_index_data_hr_hr = *(unsigned int *)(read_count_index);
    if (temp_Count_index_data_hr_hr <= Num_of_data_hr_hr)
    {
        Count_index_data_hr_hr = temp_Count_index_data_hr_hr;
    }
    else
    {
        Count_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("temp Count index : 0x%x", temp_Count_index_data_hr_hr);
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_count_index);

    NRF_LOG_INFO("==============================");
    NRF_LOG_INFO("Write index: %d", Write_index_data_hr_hr);
    NRF_LOG_INFO("Read index : %d", Read_index_data_hr_hr);
    NRF_LOG_INFO("Count index: %d", Count_index_data_hr_hr);
    NRF_LOG_INFO("==============================");

    //flash erase
    uint32_t erase_address = Flash_start_address;
    uint32_t pages_cnt = 3;
    rc = nrf_fstorage_erase(&fstorage, erase_address, pages_cnt, NULL);
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_erase() returned: %s\n", nrf_strerror_get(rc));
    }

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    NRF_LOG_INFO("Heart Rate Sensor example started.");
    NRF_LOG_INFO("Health Thermometer example started.");

    application_timers_start();
    //NRF_LOG_FLUSH();

    /*
    nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);
    ret_code_t err_code;
    err_code = app_timer_stop(m_bh1792glc_timer_id);
    APP_ERROR_CHECK(err_code);
    int32_t ret = 0;
    ret = bh1792_StopMeasure();
    error_check(ret, "bh1792_StopMeasure");
    NRF_LOG_INFO("finished bh1792_StopMeasure.");
    */

    advertising_start(erase_bonds);
    State_keeper = STATE_ADVERTISING;
    //NRF_LOG_FLUSH();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
